In [1]:
print('Hello Jupy')

Hello Jupy

In [15]:
import pandas as pd

In [16]:
import numpy

In [17]:
import os

In [26]:
df = pd.read_csv('zoo.csv', delimiter=',')

In [27]:
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [23]:
my_dict = { 'name' : ["a", "b", "c", "d", "e","f", "g"],
                   'age' : [20,27, 35, 55, 18, 21, 35],
                   'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]}

In [28]:
df = pd.DataFrame(my_dict)

In [29]:
df.head()

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP

In [31]:
df.age.min()

18

In [32]:
df[df.age == df.age.min()]

  name  age designation
4    e   18          VP

In [33]:
df[df.age == df.age.max()]

  name  age designation
3    d   55          VP

In [34]:
df

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [37]:
df['status'] = df.age.apply(lambda s: 'Youngest' if s == df.age.min() else 'A little older')

In [38]:
df

  name  age designation          status
0    a   20          VP  A little older
1    b   27         CEO  A little older
2    c   35         CFO  A little older
3    d   55          VP  A little older
4    e   18          VP        Youngest
5    f   21         CEO  A little older
6    g   35          MD  A little older